tutorials/BalmforthKerswell_01_muI/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (grain air);

grain
{
    transportModel muI;
    muICoeffs
    {
        mus       0.38;
        mud       0.65;
        I0        0.3;
        dg        0.8e-3;
        rhog      1575.0;
        nuMax     1e3;
        nuMin     1e-05;
        pMin      1.0;
        rmHydAirP true;
        rhoAir    1.0;
    }
    // transportModel Newtonian;
    // nu           1;
    rho          1575.0;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma            0.0;

// ************************************************************************* //
